<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"81a74b8eaf7a97fa56116d1a367871cdbbab8ad6ec17ba6d04b0264bf8d267d8","plan_job_ref":"Job Environment Main - Plan #434 at https://github.com/jarrod-lowe/wildsea/actions/runs/11421988605","plan_out_hash":"56bea0b3ce85406056c855b7c06f620cc3ce3ccbcaa387c9276f8e0c8be2ea68","plan_hash":"9bbecf836e0015c95bd98826cc084d85a707ed13bc6cb86580c2036c4ad1d550","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (12 unchanged attributes hidden)

!~      log_config {
!~          field_log_level          = "ALL" -> "ERROR"
#            (2 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_cognito_identity_provider.google-oauth[0] will be created
+   resource "aws_cognito_identity_provider" "google-oauth" {
+       attribute_mapping = {
+           "email"    = "email"
+           "username" = "sub"
        }
+       id                = (known after apply)
+       provider_details  = {
+           "authorize_scopes" = "profile openid email"
+           "client_id"        = (sensitive value)
+           "client_secret"    = (sensitive value)
        }
+       provider_name     = "Google"
+       provider_type     = "Google"
+       user_pool_id      = "************************"
    }

  # module.wildsea.aws_cognito_user_pool_client.cognito will be updated in-place
!~  resource "aws_cognito_user_pool_client" "cognito" {
        id                                            = "1ghmru9nk0j81l040lehbgosv1"
        name                                          = "Wildsea-primary"
!~      supported_identity_providers                  = [
+           "Google",
#            (1 unchanged element hidden)
        ]
#        (19 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #434](https://github.com/jarrod-lowe/wildsea/actions/runs/11421988605)